import React from 'react';

const Blog = () => {
    return (
        <div className='space-y-10 divide-y-2 divide-gray-600'>
            <div>
            <p className='pb-4'> 1.contex apni কখন ব্যাবহার করা হয়।</p>

<p>Ans: প্রসঙ্গ API উপাদানগুলির মধ্যে ডেটা ভাগ করতে সাহায্য করে যা আপনি সহজে প্রপসের সাথে ভাগ করতে পারবেন না , উদাহরণস্বরূপ, জটিল ডেটা অবজেক্ট৷ রিঅ্যাক্ট কনটেক্সট এপিআই প্রতিটি স্তরে ম্যানুয়ালি কোনো প্রপস না পাঠিয়ে কম্পোনেন্ট ট্রির মাধ্যমে userid, auth এবং থিম ডেটার মতো ডেটা পাঠানোর একটি উপায় প্রদান করে।</p>
            </div>

           <div>
           <p className='pb-4'>2. what is coustom hok react এর কাস্টমস হোক কি জিনিস? </p>
            <p> Ans :ব্যবহারকারীরা তৈরি করে নিজেদের প্রয়োজন মতো হুক বা প্রতিক্রিয়া লেখার জন্য ব্যবহার করতে পারে।

এটি কাস্টম হুকের মাধ্যমে ব্যবহারকারীরা একই লজিক এবং কোড টাইপ বারবার না লিখে পুনরাবৃত্তি করতে পারেন। অর্থাৎ, ব্যবহারকারীরা কোড রিপিটেশন কম করে সময় ও পরিশ্রম সংযোজন করতে পারেন।

একটি কাস্টম হুক লেখার জন্য ব্যবহারকারীকে কোন নির্দিষ্ট ফরমেট ফলো করতে হয় না। বরং এটি ব্যবহারকারীর নির্দিষ্ট প্রয়োজনে লিখা হুক যা তাদের নির্দিষ্ট কাজে সাহায্য করে তুলবে।

উদাহরণঃ একটি কাস্টম হুক ব্যবহার করে কোন ফর্মের ফিল্ডের এরর চেক করা যেতে পারে। আবার একটি কাস্টম হুক ব্যবহার করে কোন প্রসেসিং পাইপলাইন তৈরি করে তারপর সেই পাইপল</p>
           </div>

<div>
<p className='pb-4'>3. useref এই জিনিস টা কি। এটা কোন কাজে লাগে?</p>
<p>Ans: "useRef" হলো একটি Hook যা React Component এর নির্দিষ্ট একটি ডোম এলিমেন্টের রেফারেন্স সেভ করতে ব্যবহৃত হয়। সেটি ব্যবহার করে আমরা কোনো স্টেট ভ্যারিয়েবল কে অবজেক্ট আকারে সেভ করতে পারি এবং সেই অবজেক্টের মাধ্যমে ডোম এলিমেন্টের স্টেট পরিবর্তন করা যায় বিনা পুনরাবৃত্তি করে।</p>
</div>


<div>
<p className='pb-4'> 4. useMemo এই জিনিস টা কি?</p>
<p> Ans :"useMemo" হলো একটি React Hook যা ব্যবহার করে কম্পোনেন্টের রেন্ডারিং পারফরমেন্স বাড়ানো যায়।

এই হুকটি ব্যবহার করে আমরা কোনো ফাংশন বা কম্পোনেন্ট থেকে আউটপুট জেনারেট করার সময় যদি কোনো ইনপুট পরিবর্তিত না হয় তবে সেই আউটপুট ক্যাশ করে রাখা যায়। এটি পুনরাবৃত্তিহীন এবং একটি মেমোরি ওভারহেড কম রেন্ডারিং পারফরমেন্স বাড়ানোর উদ্দেশ্যে ব্যবহার করা হয়।</p>
</div>

        </div>
    );
};

export default Blog;